SIMISA@@@@@@@@@@JINX0D0t______
 
Wagon ( SR_USA_Class_30064
Type ( Engine )
WagonShape ( SR_USA_Class_30064.s )

Size  ( 2.890m 1.534m 9.064m )

Include ( ..\\Common_Locomotives\\SR_USA_wagon.inc )

 Comment ( ************************ Lights (If used) ************************
            Included in this section - Type, Colour, Location, Size, Control, etc
          *********************************************************************** )

Lights (6

Light(
Comment( light_ )
Type ( 0 )
Conditions (
Headlight ( 3 )
)
Cycle ( 0 )
FadeIn ( 0.5 )
FadeOut ( 0.5 )
States ( 1
State (
Duration ( 0.0 )
LightColour ( 80E3E3E3 )
Position ( 0.0 2.93 4.1 )
Transition ( 0 )
Radius ( 0.5 )
)
)
)

Light(
comment( Sphere of light )
Type( 1 )
Conditions(
Headlight ( 3 )
Unit ( 2 )
)
Cycle( 0 )
FadeIn( 0.5 )
FadeOut( 0.5 )
States(1
State(
Duration ( 0.0 )
LightColour ( 20ffffff )
Position ( 0 3.0 3.0 )
Transition ( 0 )

Radius ( 25.0 )
Angle ( 45.0 )

)
)
)

Light(
comment( Cab glow )
Type( 0 )
Conditions(
Headlight ( 0 )
Unit ( 0 )
)
FadeIn( 0.5 )
FadeOut( 0.5 )
Cycle( 0 )
States(1
State(
Duration ( 0.0 )
LightColour ( 80ff7200 )
Position ( 0 2.5 -2.7)
Azimuth ( -180 -180 -180 )
Transition ( 0 )
Radius ( 1 )
)
)
)

Light(
comment( Flickering firebox )
Type( 0 )
Conditions(
Headlight ( 0 )
Unit ( 0 )
)
FadeIn( 0.5 )
FadeOut( 0.5 )
Cycle( 0 )
States(2
State(
Duration ( 0.05 )
LightColour ( 80ff7200 )
Position ( 0 2.5 -2.7 )
Azimuth ( -180 -180 -180 )
Transition ( 0 )
Radius ( 1.4 )
)
State(
Duration ( 0.05 )
LightColour ( 80ffe610 )
Position ( 0 2.5 -2.7 )

Azimuth ( -180 -180 -180 )
Transition ( 0 )
Radius ( 1.4 )
)
)
)

Light(
comment( flickering fire underneath LHS )
Type( 0 )
Conditions(
Headlight ( 0 )
TimeOfDay ( 2 )
Unit ( 0 )
)
FadeIn( 0.5 )
FadeOut( 0.5 )
Cycle ( 0 )
States(4
State(
Duration ( 0.02 )
LightColour ( aaffa200 )
Position ( -0.1 1.0 -2.0 )
Azimuth ( -45 -90 -135 )
Transition ( 0 )
Radius ( 3 ))
State(
Duration ( 0.01 )
LightColour ( aaffae00 )
Position (-0.1 1.0 -2.0)
Azimuth ( -45 -90 -135 )
Transition ( 0 )
Radius ( 1 )
)
State(
Duration ( 0.03 )
LightColour ( aaffa900 )
Position (-0.1 1.0 -2.1 )
Azimuth ( -45 -90 -135 )
Transition ( 0 )
Radius ( 2 ))
State(
Duration ( 0.01 )
LightColour ( aaffa000 )
Position (-0.1  1.0 -2.1 )
Azimuth ( -45 -90 -135 )
Transition ( 0 )
Radius ( 4 ))
)
)

Light(
comment( flickering fire underneath RHS )
Type( 0 )
Conditions(
Headlight ( 0 )
TimeOfDay ( 2 )
Unit ( 0 )
)
FadeIn( 0.5 )
FadeOut( 0.5 )
Cycle ( 0 )
States(4
State(
Duration ( 0.02 )
LightColour ( aaffa200 )
Position ( 0.1  1.0 -2.0 )
Azimuth ( 45 90 135 )
Transition ( 0 )
Radius ( 3 ))
State(
Duration ( 0.01 )
LightColour ( aaffae00 )
Position (0.1  1.0 -2.0)
Azimuth ( 45 90 135 )
Transition ( 0 )
Radius ( 3 )
)
State(
Duration ( 0.03 )
LightColour ( aaffa900 )
Position (0.1  1.0 -2.1 )
Azimuth ( 45 90 135 )
Transition ( 0 )
Radius ( 2 ))
State(
Duration ( 0.01 )
LightColour ( aaffa000 )
Position (0.1  1.0 -2.1 )
Azimuth ( 45 90 135 )
Transition ( 0 )
Radius ( 4 ))
)
)
) 


Comment ( ********************* Wagon Visual Effects *********************
                      Included in this section - Effect type, etc
          *********************************************************************** )

Comment ( ******************** Freight and Load Animations (If used) ***************
                Included in this section - Freight Animation information, etc
          *********************************************************************** )

Comment ( Mass loaded 100650lb, mass without fuel and water 88150lb, coal 2500lb, water 1200g-us = 10000lb )

ORTSFreightAnims (

MSTSFreightAnimEnabled (1)

WagonEmptyWeight( 88150lb )
EmptyORTSDavis_A ( 2492 )
EmptyORTSDavis_B ( 90.4 )
EmptyCentreOfGravity_Y ( 1.5 )

FreightAnimContinuous (
FreightWeightWhenFull( 12500lb )
ORTSDavis_A ( 2846 )
ORTSDavis_B ( 103 )
FullCentreOfGravity_Y ( 2.0 ) )

)

FreightAnim (Fittings_SR_USA.s 1.0 3.0 1.0)

)
 
 
Engine ( SR_USA_Class_30064
Effects (
SteamSpecialEffects (

SafetyValvesFX (
0.15 3.86 0.45
0 1 0
0.34 )
SafetyValvesFX (
-0.15 3.86 0.45
0 1 0
0.34 )

WhistleFX (
0.5 3.9 0.4
0 1 0
0.22 )

StackFX (
0 3.75 3.09
0 1 0
0.35 )

CylindersFX (
1.0 0.7 3.6
0 -1.0 0
0.22 )
Cylinders2FX (
-1.0 0.7 3.6
0 -0.2 1.4
0.22 )
CylindersFX (
-1.0 0.4 2.6
0 -0.4 -0.4
0.11 )
Cylinders2FX (
1.0 0.4 2.6
0 -0.4 -0.4
0.11 )

Injectors1FX (
1.00 0.34 -3.60
0 -1 -1
0.1 )
Injectors2FX (
-1.00 0.34 -3.60
0 -1 -1
0.1 )

LargeEjectorFX (
 -1.10 1.20 -2.40
 -0.2 -1.0 0
 0.15 )
SmallEjectorFX (
 -1.10 1.20 -2.40
 -0.2 -1.0 0
 0.10 )

)
)
Include ( ..\\Common_Locomotives\\SR_USA_engine.inc )

HeadOut (  1.5 2.8 -4.0 )

Name ( "SR_USA_Class_30064" )

Description (
        "Built to US Army Transport Corps design S100, used by Southern Railway after WW2.  \n"+

"Version 1.0\n"

    )
    EngineOperatingProcedures (
"To move forward\n"+
"1.Press the W key several times to move the Reverser to full Forward.\n"+
"2.Press the ; (SEMICOLON) key to release the train brakes.\n"+
"3.Press the D key to increase the Regulator setting.\n"+  
"4.As you accelerate, press the S key to slowly reduce the Reverser setting, then adjust the Regulator to maintain the desired speed.\n\n"+
"To slow the train\n"+
"1.Press the A key to move the Regulator to a lower setting.\n"+
"2.Use the brakes to further reduce speed if desired.\n\n"+
"To apply the train brakes\n"+
"1.Press the ' (APOSTROPHE) key to apply the train brakes.\n"+
"2. To hold the brakes at their current setting, lower the brake lever until it's in its middle (Neutral) position, by pressing the ; (SEMICOLON) key.\n\n"+
"To release the train brakes\n"+
"1. Press  the ; (SEMICOLON) key to release the train brakes.\n"+
"2. When the brakes are released, raise the brake lever until it's in its middle (Neutral) position, by pressing the ' (APOSTROPHE) key.\n\n"+
"To back up\n"+
"1.Bring your train to a full stop.\n"+ 
"2.Press the S key several times to move the Reverser to the full Reverse position.\n"+
"4.Press the ; (SEMICOLON) key to release the brakes.\n"+
"5.Slowly advance the regulator (D key).\n\n"+
"To load and unload passengers\n"+
"1. Stop at a station.\n"+
"2. Press the ENTER key.\n"+
"3. Wait for the \"permission to depart\" whistle.\n"+
"TIP: Use the Next Station driving aid (F10) to monitor loading and unloading.\n\n"+
"To couple to a car or locomotive\n"+
"1. Coast into the unit at a very slow speed, about 2 mph.\n"+
"TIP: To use the Coupling view, press the 6 key.\n"+
"2. Press F9 to open the Train Operations window.\n"+
"3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
"4. Close the Train Operations window.\n\n"+
"To uncouple from a car or locomotive\n"+
"1. Press F9 to open the Train Operations window.\n"+
"2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
"3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
"4. Close the Train Operations window.\n\n"+
"Firing commands (Automatic Fireman OFF in Options screen)\n"+
"To add coal to the firebox\n"+
"1. Press the F key to open the Firebox door.\n"+
"2. Press the R key to increase the shoveling rate.\n\n"+
"To stop adding coal to the fire\n"+
"1. Press SHIFT+R to decrease the shoveling rate.\n"+
"2. Press SHIFT+F to close the firebox door.\n\n"+
"To operate the blower\n"+
"1.Press the N key to increase the blower.\n"+
"2. Press SHIFT+N to decrease the blower.\n\n"+
"To operate the dampers\n"+
"1.Press the M key to open the dampers.\n"+
"2. Press SHIFT+M to close the dampers.\n\n"+
"To inject water into the boiler\n"+
"1.Press the I key to turn on the steam to Injector 1.\n"+
"(You can also press the O key to turn on the steam to Injector 2.)\n"+
"2.Press the K key to increase the water flow to Injector 1.\n"+
"(To increase the water flow to Injector 2, press the L key.)\n\n"+
"To stop boiler water injection\n"+ 
"1. Press the I key to turn off the steam to Injector 1.\n"+
"2. Press the O key to turn off the steam to Injector 2."
    )
)